In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"name" : ["Animal","Lion","Dog","Cheetah","Tiger"]})
df

      name
0   Animal
1     Lion
2      Dog
3  Cheetah
4    Tiger

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
#fit train the model and transform convert the data
le = LabelEncoder()
le.fit_transform(df["name"])
#fit_transform is used when you have training model
#fit is used when you have to deploy the model

array([0, 3, 2, 1, 4])

In [6]:
df["en_name"] = le.fit_transform(df["name"])
df

      name  en_name
0   Animal        0
1     Lion        3
2      Dog        2
3  Cheetah        1
4    Tiger        4

Here we encoded the unsequenced(nominal) data into numerical form
Now we will label the dataset in similar way

In [10]:
dataset = pd.read_csv("C:\\vs-code-folder\\ML_Practice\\Bengaluru_House_Data.csv")

In [11]:
dataset.head(8)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00

In [15]:
dataset.shape

(13320, 9)

In [17]:
la = LabelEncoder()
la.fit_transform(dataset["area_type"])

array([3, 2, 0, ..., 0, 3, 3])

In [18]:
dataset["area_type"] = la.fit_transform(dataset["area_type"])#replace categorical values of area_type with numerical value

In [19]:
dataset.head(8)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,3,19-Dec,Electronic City Phase II,2 BHK,464,1056,2.0,1.0,39.07
1,2,Ready To Move,Chikka Tirupathi,4 Bedroom,2439,2600,5.0,3.0,120.00
2,0,Ready To Move,Uttarahalli,3 BHK,2688,1440,2.0,3.0,62.00
3,3,Ready To Move,Lingadheeranahalli,3 BHK,2186,1521,3.0,1.0,95.00
4,3,Ready To Move,Kothanur,2 BHK,2688,1200,2.0,1.0,51.00
5,3,Ready To Move,Whitefield,2 BHK,607,1170,2.0,1.0,38.00
6,3,18-May,Old Airport Road,4 BHK,939,2732,4.0,NaN,204.00
7,3,Ready To Move,Rajaji Nagar,4 BHK,360,3300,4.0,NaN,600.00